```json
{
  "numero": "11",
  "conteudo_principal": "Inteligência Artificial e Aprendizado de Máquina, especificamente Redes Neurais Profundas (Deep Learning) e suas arquiteturas (Redes Convolucionais, Redes Recorrentes), bem como conceitos de treinamento, hiperparâmetros, avaliação de desempenho (acurácia) e otimização de tempo de treinamento em tarefas de classificação de imagens.",
  "justificativa_correta": "A alternativa correta é a D, que afirma que as sentenças II e IV estão corretas.\n\n**II. Fazer uso de redes convolucionais é uma alternativa que pode levar a uma melhora na acurácia, no entanto, pode exigir uso de máquinas com maior poder de processamento.**\n*   **Melhora na acurácia:** Redes Convolucionais (CNNs) são arquiteturas de rede neural projetadas especificamente para processamento de imagens e são altamente eficazes em capturar padrões espaciais e hierárquicos em dados visuais. Para a tarefa de classificação de imagens, como a detecção de personagens em sites, as CNNs superam significativamente as redes neurais densas (totalmente conectadas) em termos de acurácia, pois utilizam camadas convolucionais para extrair características relevantes das imagens.\n*   **Exigir maior poder de processamento:** O treinamento de CNNs, especialmente as profundas, envolve um grande número de operações matemáticas (convoluções, pooling) e um vasto número de parâmetros, o que as torna computacionalmente intensivas. Geralmente, requerem o uso de GPUs (Unidades de Processamento Gráfico) ou hardware especializado para serem treinadas em um tempo razoável.\n\n**IV. Aumentar o número de amostras de treinamento é uma alternativa que pode levar a uma melhora na acurácia, apesar de aumentar o tempo de treinamento da rede.**\n*   **Melhora na acurácia:** Um volume maior e mais diversificado de dados de treinamento permite que a rede neural aprenda padrões mais robustos e generalizes melhor para dados não vistos, reduzindo o risco de overfitting e, consequentemente, melhorando a acurácia em novos exemplos.\n*   **Aumentar o tempo de treinamento:** Treinar uma rede neural com mais amostras de dados significa que o algoritmo de otimização (como o gradiente descendente) precisa processar mais informações a cada época de treinamento. Isso diretamente se traduz em um tempo de treinamento mais longo, pois há mais cálculos a serem realizados para cada iteração de ajuste dos pesos.",
  "justificativas_erradas": {
    "I": "**Aumentar o número de camadas é uma alternativa que pode levar a uma melhora na acurácia, além de diminuir o tempo de treinamento da rede.**\n*   **Melhora na acurácia:** Aumentar o número de camadas (profundidade) em uma rede neural profunda pode, de fato, permitir que ela aprenda representações mais complexas e abstratas dos dados, potencialmente melhorando a acurácia para tarefas difíceis. No entanto, redes excessivamente profundas podem sofrer de problemas como o desaparecimento/explosão de gradientes ou dificuldade de treinamento.\n*   **Diminuir o tempo de treinamento:** Esta parte da afirmação está incorreta. Adicionar mais camadas significa mais operações computacionais por passagem (forward e backward pass) e mais parâmetros para otimizar. Isso leva a um *aumento* significativo no tempo de treinamento, não a uma diminuição.",
    "III": "**Aumentar o número de unidades de processamento (neurônios) nas camadas pode levar a uma piora na acurácia, além de diminuir o tempo de treinamento da rede.**\n*   **Piora na acurácia:** Aumentar o número de neurônios (largura) em uma camada pode, até certo ponto, melhorar a capacidade da rede de aprender padrões complexos. No entanto, um número excessivo de neurônios pode levar a um modelo superparametrizado, aumentando o risco de overfitting (onde a rede aprende 'ruído' nos dados de treinamento e não generaliza bem para novos dados), o que resultaria em uma piora na acurácia em dados de teste. Contudo, a frase 'pode levar a uma piora' é condicional e possível. O principal erro está na segunda parte.\n*   **Diminuir o tempo de treinamento:** Esta parte da afirmação está incorreta. Mais neurônios em uma camada implicam mais pesos e mais operações computacionais (multiplicações e somas) durante as passagens de forward e backward. Isso resulta em um *aumento* no tempo de treinamento, não em uma diminuição.",
    "V": "**Fazer uso de redes recorrentes é uma alternativa que pode levar a uma melhora na acurácia, no entanto, pode exigir uso de máquinas com maior poder de processamento.**\n*   **Melhora na acurácia:** Redes Recorrentes (RNNs) são projetadas para processar dados sequenciais (como texto, áudio, séries temporais) onde a ordem dos elementos é crucial e a saída de um passo depende de entradas anteriores. A tarefa descrita na questão é a classificação de imagens estáticas, que não possui uma natureza sequencial inerente. Para este tipo de problema, as CNNs são a arquitetura padrão e mais eficaz. Usar RNNs para classificação de imagens estáticas diretamente provavelmente não levaria a uma melhora na acurácia e poderia até ter desempenho inferior a outras arquiteturas mais adequadas.\n*   **Exigir maior poder de processamento:** RNNs, especialmente para sequências longas, podem ser computacionalmente intensivas e também se beneficiam de hardware poderoso, o que torna a segunda parte da afirmação plausível. No entanto, a premissa de que elas melhorariam a acurácia para *esta tarefa específica* é incorreta."
  },
  "dcn_relacionadas": [
    "3.1. Conteúdos Curriculares da Formação Tecnológica e Básica para todos os Cursos de Bacharelado e de Licenciatura: inteligência artificial e computacional",
    "3.1. Conteúdos Curriculares da Formação Tecnológica e Básica para todos os Cursos de Bacharelado e de Licenciatura: processamento de imagens",
    "3.1. Conteúdos Curriculares da Formação Tecnológica e Básica para todos os Cursos de Bacharelado e de Licenciatura: algoritmos e complexidade",
    "3.1. Conteúdos Curriculares da Formação Tecnológica e Básica para todos os Cursos de Bacharelado e de Licenciatura: modelagem computacional",
    "2.2. Competências e Habilidades dos Egressos dos Cursos de Bacharelado em Ciência da Computação: V - especificar, projetar, implementar, manter e avaliar sistemas de computação, empregando teorias, práticas e ferramentas adequadas;",
    "2.2. Competências e Habilidades dos Egressos dos Cursos de Bacharelado em Ciência da Computação: VI - conceber soluções computacionais a partir de decisões visando o equilíbrio de todos os fatores envolvidos;",
    "2.2. Competências e Habilidades dos Egressos dos Cursos de Bacharelado em Ciência da Computação: VII - empregar metodologias que visem garantir critérios de qualidade ao longo de todas as etapas de desenvolvimento de uma solução computacional;",
    "2.2. Competências e Habilidades dos Egressos dos Cursos de Bacharelado em Ciência da Computação: VIII - analisar quanto um sistema baseado em computadores atende os critérios definidos para seu uso corrente e futuro (adequabilidade);",
    "2.2. Competências e Habilidades dos Egressos dos Cursos de Bacharelado em Ciência da Computação: XII - aplicar os princípios de gerência, organização e recuperação da informação de vários tipos, incluindo texto imagem som e vídeo;"
  ],
  "nivel_cognitivo": "Médio",
  "tags": [
    "Inteligência Artificial",
    "Aprendizado de Máquina",
    "Redes Neurais Profundas",
    "Deep Learning",
    "Redes Convolucionais (CNN)",
    "Otimização de Treinamento",
    "Acurácia",
    "Hiperparâmetros",
    "Processamento de Imagens",
    "Visão Computacional"
  ]
}
```